#!/usr/bin/env python
# -*- coding: utf-8 -*-

top_500 = [
    '가', '간', '갈', '갉', '감', '갔', '갖', '같', '갚', '개', '걔', '걘', '거', '건', '걷', '걸', '검', '겪', '곤', '골', '곪', '곱', '괴',
    '구', '군', '굵', '굶', '굼', '굽', '궤', '귑', '귓', '규', '균', '긁', '긋', '기', '길', '긺', '깊', '까', '깎', '깐', '깖', '깜', '깠',
    '깨', '깬', '깼', '꺼', '꺾', '껐', '껴', '꼈', '꼬', '꼽', '꽂', '꽤', '꾸', '꾼', '꿇', '꿈', '꿔', '꿨', '꿰', '뀌', '끈', '끊', '끌',
    '끎', '끓', '끔', '끼', '낀', '낌', '나', '낚', '난', '날', '낡', '남', '났', '낮', '내', '낸', '냄', '냅', '냈', '넓', '넘', '넣', '녹',
    '논', '놀', '놂', '높', '놓', '놔', '놨', '누', '눈', '눕', '눠', '늘', '늙', '늚', '늦', '닦', '단', '닫', '달', '닮', '닳', '담', '답',
    '닿', '대', '댄', '댐', '댔', '던', '덜', '덞', '덥', '덮', '데', '덴', '뎀', '뎄', '돈', '돋', '돌', '돕', '돼', '됐', '되', '된', '됨',
    '두', '둔', '둠', '뒀', '든', '듣', '들', '듦', '듬', '딛', '딪', '따', '딴', '땀', '땄', '땋', '땠', '떠', '떨', '떴', '떼', '뗀', '뗌',
    '뛰', '뜀', '뜨', '뜯', '뜸', '띄', '띈', '띔', '띠', '띤', '막', '만', '많', '말', '맑', '맒', '맞', '맡', '매', '맨', '맴', '맵', '맸',
    '맺', '먹', '멀', '멂', '메', '멘', '멨', '몬', '몰', '몲', '묵', '묶', '묻', '물', '묽', '묾', '뭍', '뭘', '민', '믿', '밀', '밂', '밈',
    '밉', '박', '받', '밝', '밟', '배', '밴', '뱀', '뱄', '뱉', '번', '벌', '벎', '벗', '베', '벤', '보', '볶', '본', '봄', '봤', '봬', '뵀',
    '뵈', '뵌', '분', '붇', '불', '붉', '붊', '붓', '붙', '비', '빈', '빌', '빎', '빔', '빚', '빤', '빨', '빪', '빻', '빼', '뺀', '뺌', '뺐',
    '뻗', '뻤', '뼜', '뿜', '삔', '삠', '사', '산', '살', '삵', '삶', '삼', '샀', '새', '샌', '샘', '샛', '샜', '서', '섞', '선', '섰', '세',
    '셈', '셌', '속', '솎', '솟', '숨', '쉬', '쉰', '쉼', '쉽', '시', '식', '싣', '싫', '싶', '싸', '싼', '쌈', '쌌', '쌓', '쌔', '쌨', '써',
    '썩', '썰', '썲', '썼', '쎄', '쏘', '쏜', '쏟', '쏨', '쏴', '쐈', '쑤', '쑨', '쓰', '쓴', '쓸', '쓺', '씀', '씌', '씐', '씹', '안', '앉',
    '않', '알', '앎', '앓', '암', '약', '얇', '얕', '얘', '얜', '언', '얹', '얻', '얼', '없', '엎', '엮', '연', '열', '엶', '옅', '옌', '옛',
    '오', '온', '옭', '옮', '옳', '옴', '와', '왔', '왜', '운', '울', '읊', '일', '읽', '잃', '입', '있', '잊', '자', '작', '잔', '잡', '잤',
    '잦', '재', '잰', '잼', '쟀', '쟤', '쟨', '적', '전', '절', '젊', '접', '젓', '져', '졌', '존', '졸', '졺', '좁', '좇', '좋', '주', '죽',
    '준', '줌', '줍', '줘', '줬', '쥐', '쥠', '지', '진', '질', '집', '짓', '짖', '짙', '짜', '짧', '짰', '째', '짼', '쨌', '쩐', '쩔', '쪄',
    '쪘', '쫀', '쬐', '쬠', '찌', '찍', '찐', '찜', '찝', '찢', '차', '찬', '참', '찼', '찾', '채', '챈', '챘', '쳐', '쳤', '추', '춘', '춤',
    '춥', '춰', '췄', '치', '친', '침', '캐', '캠', '캤', '커', '컸', '켜', '켠', '켬', '켰', '크', '큼', '키', '킨', '킴', '타', '탄', '탐',
    '탔', '터', '턺', '텁', '텨', '튀', '튄', '튐', '트', '튼', '틂', '틈', '파', '팔', '팜', '팠', '패', '팼', '퍼', '펌', '펐', '펴', '편',
    '폄', '폈', '푼', '품', '피', '핀', '핌', '하', '핥', '함', '해', '했', '헌', '휘', '희',
]

before = {
    # 조사
    "이", "가", "에서", "은", "는", "을", "를", "도", "에", "게", "께", "한테", "로", "써",
    "와", "과", "랑", "까지", "부터", "뿐", "만", "따라", "토록", "도록", "든지", "던지", "란",
    "만큼", "만치", "때",

    # 부사
    "너무", "잘", "못", "빨리", "매우", "몹시", "별로", "아까", "내일", "일찍", "금방",
    "이미", "이리", "저리", "아니", "과연", "설마", "제발", "정말", "결코", "가득", "히",

    # 대명사
    "나", "저", "우리", "저희", "너", "너희", "당신", "그대", "그", "그녀", "분", "놈", "거", "것",
    "여기", "저기", "쪽", "곳", "님"
}

post_processing_da = list(set([f"{x} {_}다 " for _ in top_500 for x in before]))
post_processing_yo = list(set([f"{x} {_}요 " for _ in top_500 for x in before]))
post_processing_jyo = list(set([f"{x} {_}죠 " for _ in top_500 for x in before]))
